Revit 2026 API

# CriticalPathIterator Class

---

An iterator to traverse the critical path in the CriticalPathCollector.

SystemObject Autodesk.Revit.DB.AnalysisCriticalPathIterator

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CriticalPathIterator : IEnumerator<MEPNetworkSegmentId>
```
```vb
Public Class CriticalPathIterator
	Implements IEnumerator(Of MEPNetworkSegmentId)
```
```cpp
public ref class CriticalPathIterator : IEnumerator<MEPNetworkSegmentId^>
```
```fsharp
type CriticalPathIterator =
    class
        interface IEnumerator<MEPNetworkSegmentId>
    end
```

The CriticalPathIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CriticalPathIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Gets the analytical segment id at the current iterating position. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next downstream segment on the critical path. |
|  | Reset | Resets the iterator to the beginning segment. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace